Repository: viollenaki/ADAY-project
Catalog: lib/l10n/intl_*.arb
Languages: ky

source: Language
ky: Тил

source: Logout
ky: Чыгуу

source: Personal Finance
ky: Жеке каржы

source: Delete All Transactions
ky: Бардык транзакцияларды жок кылуу

source: Are you sure you want to delete all transactions?
ky: Бардык транзакцияларды чын эле жок кылгыңыз келеби?

source: Cancel
ky: Жокко чыгаруу

source: Delete
ky: Жок кылуу

source: Are you sure you want to logout?
ky: Чын эле чыгасызбы?

source: Income
ky: Киреше

source: Expenses
ky: Чыгымдар

source: Balance
ky: Баланс

source: Recent Transactions
ky: Акыркы транзакциялар

source: Transaction Actions
ky: Транзакция аракеттери

source: What would you like to do?
ky: Эмне кылгыңыз келет?

source: Edit
ky: Түзөтүү

source: Delete Transaction
ky: Транзакцияны жок кылуу

source: Are you sure you want to delete this transaction?
ky: Бул транзакцияны чын эле жок кылгыңыз келеби?

source: Guest
ky: Конок

source: Account
ky: Акаунт

# ategory
source: Ð¡ategory
ky: Категория

source: Delete All
ky: Баарын жок кылуу

source: No transactions yet.
ky: Азырынча транзакциялар жок.

source: Welcome Back!
ky: Кайра кош келиңиз!

source: Create Account
ky: Эсеп түзүү

source: Username
ky: Колдонуучунун аты

source: Please enter a username
ky: Сураныч, колдонуучу атын киргизиңиз

source: Password
ky: Купуя сөз

source: Please enter a password
ky: Сырсөздү киргизиңиз

source: Email
ky: Электронная почта

source: Please enter an email
ky: Сураныч, электрондук почтаны киргизиңиз

source: Please enter a valid email
ky: Жарактуу электрондук почтаны киргизиңиз

source: User already exists or registration failed.
ky: Колдонуучу мурунтан эле бар же каттоодон өткөн жок.

source: Login
ky: Кирүү

source: Register
ky: Каттоо

source: Don't have an account? Register
ky: Каттоо эсебиңиз жокпу? Каттоо

source: Already have an account? Login
ky: Каттоо эсебиңиз барбы? Кирүү

source: Delete Category
ky: Категорияны жок кылуу

source: Category deleted
ky: Категория жок кылынды

source: Add New Category
ky: Жаңы категория кошуу

source: Category Name
ky: Категориянын аталышы

source: Expense
ky: Чыгым

source: Category Type
ky: Категориянын түрү

source: Category added successfully
ky: Категория ийгиликтүү кошулду

source: Add
ky: кошуу

source: Categories
ky: Категориялар

source: Add Category
ky: Категория кошуу

source: Income Categories
ky: Киреше категориялары

source: Expense Categories
ky: Чыгымдар категориялары

source: Reports & Charts
ky: Отчёттор жана диаграммалар

source: No data available
ky: Жеткиликтүү маалымат жок

source: Income Overview
ky: Киреше жөнүндө сереп

source: Expense Overview
ky: Чыгымдарды карап чыгуу

source: Monthly Spending Trends
ky: Айлык чыгаша тенденциялары

source: Select Start Date
ky: Баштоо күнүн тандоо

source: Select End Date
ky: Аяктуу датаны тандоо

source: Filter by Category
ky: Категория боюнча чыпкалоо

source: No data available for the selected filters
ky: Тандалган чыпкалар үчүн маалымат жок

source: Start: ${selectedStartDate!.toLocal().toString().split(' ')[0]}
ky: Старт: ${selectedStartDate!.toLocal().toString().split(' ')[0]}

source: End: ${selectedEndDate!.toLocal().toString().split(' ')[0]}
ky: Аяктоо: ${selectedEndDate!.toLocal().toString().split(' ')[0]}
